print("Выберите тип задачи: \n 1)кодирование информации \n 2)кодирование звука \n 3) кодирование изображения")
a = int(input("Введите тип задачи: "))
if a ==1:
    b=
    ("Какой вид данных НУЖНО узнать: \n 1)Мощность алфавита \n2Рразряд двоичного кода \n3)Объём информации \n4)Кол-во информации"))
    if b==1:
        print("Какой вид данных ЕСТЬ: \n1)Рразряд двоичного кода(i) \n2)Объём информации \n3)Кол-во информации")
        
    elif a ==2:
   print("Какой вид данных нужно узнать: \n 1)шаг дискретизации \n2) частота дискретизации \n3) битовая глубина \n4) колво измерений")

